app/controllers/users_controller.rb

  def index
  @users = User.all
---
SELECT "users".* FROM "users"   ORDER BY drink_level LIMIT -1 OFFSET 1

  def result
    @searched_users = User.where("#{params[:column]} = ?", params[:id])
---
SELECT "users".* FROM "users"  WHERE (params[:column] = 'U1001')